Revit 2026 API

# EnergyAnalysisSurfaceAzimuth Property

---

The azimuth angle for this surface, in radians.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Azimuth { get; }
```
```vb
Public ReadOnly Property Azimuth As Double
	Get
```
```cpp
public:
property double Azimuth {
	double get ();
}
```
```fsharp
member Azimuth : float with get
```

#### Property Value

Double

The azimuth is computed as the angle of rotation between the outward normal of the surface and the Y-axis (clockwise is positive).

#### Reference

EnergyAnalysisSurface Class

Autodesk.Revit.DB.Analysis Namespace